#include "Main.h"
#include "Game.h"
#include "Title.h"
#include "Float2.h"
#include "Hit.h"

//=================================================================================
//	リザルト（結果表示）画面の処理
//=================================================================================

 int result_image;	//	リザルト（結果表示）画面の背景画像
 int button_image;	//	ボタン画像

Float2 button_pos;		//	ボタン座標
Float2 button_size;		//	ボタンの大きさ

//---------------------------------------------------------------------------------
//	初期化
//---------------------------------------------------------------------------------
void ResultInit()
{
	button_pos.x = 200.0f;
	button_pos.y = 100.0f;

	button_size.x = 100.0f;
	button_size.y = 100.0f;
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void ResultUpdate()
{
	//	マウスをクリックしたら
	if( PushMouseInput() ){
		//	マウス座標の取得
		Float2 mouse;
		mouse.x = (float)GetMouseX();
		mouse.y = (float)GetMouseY();

		//	マウス座標とボタン四角で当たり判定（ Float2 バージョン）
		if( CheckPointBoxHit( mouse, button_pos, button_size ) ){
			//	次に行きたいシーン番号を設定しています
			scene_next = SCENE_TITLE;
		}
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void ResultRender()
{
	//	リザルト（結果表示）背景の描画
	DrawGraph( 0, 0, result_image, TRUE );

	//	ボタン画像の描画
	DrawGraphF( button_pos.x, button_pos.y, button_image, TRUE );

	DrawString( 20, 20, "【結果表示画面】", GetColor( 255, 255, 255 ) );
	DrawString( 20, 40, "ボタン画像をクリックしたらタイトルへ", GetColor( 255, 255, 255 ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void ResultExit()
{
}
